Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G01B.tmx
Source language: en_us
Languages: zh_cn

source: Princess Diana Biography
zh_cn: 戴安娜传记

source: British royalty. Born Diana Spencer on July 1st, 1961, near Sandringham, England.
zh_cn: 生母是英国皇室成员的戴安娜出生于1961年7月1日，英国桑德林汉姆小镇附近。

source: Diana, Princess of Wales, was one of the most adored members of the British royal family.
zh_cn: 她是威尔士王妃，最受民众爱戴的英国皇室家族成员之一。

source: She was the daughter of Edward John Spencer, Viscount Althorp, and Frances Ruth Burke Roche, Viscountess Althorp (later known as the Honorable Frances Shand Kydd).
zh_cn: 她是奥尔索普子爵爱德华-约翰-斯宾瑟和子爵夫人弗朗西斯鲁思·伯克罗氏（后来以可敬的Frances Shand Kydd为人所知）的女儿。

source: Her parents divorced when Diana was young, and her father won custody of her and her siblings.
zh_cn: 在戴安娜小时候她的父母就离婚了，她的父亲赢得了对她和她兄弟姐妹的监护权。

source: She was educated first at Riddlesworth Hall and then went to boarding school at West Heath School.
zh_cn: 她最初在让德沃斯豪尔女校学习，后来到西希斯学校寄宿。

source: She became Lady Diana Spencer after her father inherited the title of Earl Spencer in 1975.
zh_cn: 1975年，她的父亲继承了厄尔-斯宾塞的头衔，之后她就成为戴安娜-斯宾塞小姐了。

source: Although she was known for her shyness growing up, she did show an interest in music and dancing.
zh_cn: 虽然众所周知，她羞怯的性格伴随着她的成长，但是她却表现出对音乐和舞蹈的热衷。

source: Diana also had a great fondness for children.
zh_cn: 此外戴安娜也非常喜欢小孩。

source: After attending finishing school at the Institut Alpin Videmanette in Switzerland, she moved to London.
zh_cn: 在出席瑞士的Alpin Videmanette学院的毕业式之后，她就搬到了伦敦。

source: She began working with children, eventually becoming a kindergarten teacher at the Young England School.
zh_cn: 她开始和孩子们一起工作，最终她在Young England学校成为了一名幼儿园老师。

source: Diana was no stranger to the British royal family, having reportedly played with Prince Andrew and Prince Edward as a child while her family rented Park House, an estate owned by Queen Elizabeth II.
zh_cn: 戴安娜对英国皇室家族来说并不算是生人，据传闻，戴安娜小时候曾与安德鲁王子和爱德华王子一起玩耍过，那时她家正借住在Park House（这座房产归伊丽莎白女王二世所有）里。

source: In 1977, she became reacquainted with their older brother, Prince Charles, who was 13 years her senior.
zh_cn: 1977年，戴安娜逐渐与比她年长13岁的兄长查尔斯王子重新熟悉起来。

source: As the heir to the British throne, Prince Charles was usually the subject of media attention and his courtship of Diana was no exception.
zh_cn: 作为英国皇位的继承人，查尔斯王子一直以来是媒体关注的对象，他对戴安娜的追求也不例外。

source: The press and the public were fascinated by this seemingly odd couple - the reserved, garden-loving prince and the shy young woman with an interest in fashion and popular culture.
zh_cn: 媒介和民众为这对看起来古怪的情侣而着迷——一个是保守且热衷园艺的王子，一个是对时尚和流行文化富有兴趣的青涩姑娘。

source: When the couple married on July 29, 1981, the ceremony was broadcast on television around the world, with millions of people tuning in to see what many considered to be the wedding of the century.
zh_cn: 当这对爱侣在1981年7月29日步入婚姻殿堂的时，婚礼仪式通过电视在全世界范围内直播，彼时正有数百万人收看了这场被世人称道的世纪婚礼。

source: On June 21, 1982, Diana and Charles had their first child: Prince William Arthur Philip Louis.
zh_cn: 1982年6月21日，戴安娜和查尔斯迎来了他们的第一个孩子：亚瑟-菲利普-路易斯-威廉王子。

source: He was joined by a brother, Prince Henry Charles Albert David -known widely as "Prince Harry"- more than two years later on September 15, 1984.
zh_cn: 两年多以后，1984年9月15日，威廉王子多了个弟弟作伴，即亨利·查尔斯·阿尔伯特·大卫——众所周知的“哈里王子”。

source: Initially overwhelmed by her royal duties and the intense media coverage of nearly every aspect of her life, she began to develop and pursue her own interests.
zh_cn: 起初，由于戴安娜对皇室职责和媒体对她生活各方面的频繁报道感到力不从心，她开始培养和追求她自己的志趣。

source: Diana served a strong supporter of many charities and worked to help the homeless, people living with HIV and AIDS, and children in need.
zh_cn: 戴安娜为许多慈善机构提供巨大的支持，并致力于帮助流浪汉、艾滋病患者以及需要帮助的儿童。

source: Unfortunately, the fairy tale wedding of Princess Diana and Prince Charles did not lead to a happily-ever-after marriage.
zh_cn: 不幸的是，戴安娜王妃和查尔斯王子童话般的婚礼没能走向一段永远幸福快乐的婚后生活。

source: The two became estranged over the years, and there were reports of infidelities from both parties.
zh_cn: 两人多年来变得疏远，双方都有外遇的传闻。

source: During their union, Diana struggled with depression and bulimia.
zh_cn: 在他们的婚姻中，戴安娜一直与抑郁症和暴食症痛苦斗争。

source: The couple's separation was announced in December 1992 by British Prime Minister John Major, who read a statement from the royal family to the House of Commons.
zh_cn: 1992年12月，英国首相约翰梅杰宣读一份来自皇室家族的声明，向下议院宣布了这对夫妇的离异。

source: The divorce was finalized in 1996.
zh_cn: 这场离异在1996年完成。

source: Even after the divorce, Diana maintained a high level of popularity.
zh_cn: 即使在离婚后，戴安娜仍保持着非常高的受欢迎度。

source: She devoted herself to her sons and to such charitable efforts as the battle against the use of land mines.
zh_cn: 她将自己奉献给了她的儿子们以及慈善事业，例如与滥用土地矿产的行为做斗争。

source: Diana used her international celebrity to help raise awareness about this issue.
zh_cn: 戴安娜利用她的国际名声强化了人们对这类问题的意识。

source: She also continued to experience the negative aspects of fame - her 1997 romance with Egyptian film producer and playboy Dodi Al-Fayed caused quite a stir and created a media frenzy.
zh_cn: 然而她也同样继续深受名声给她带来的负面影响——1997年她与一个花花公子、埃及电影制片人Dodi Al-Fayed的恋情掀起了轩然大波并引发了媒体的狂热。

source: While visiting Paris, the couple was involved in a car crash after trying to escape from the paparazzi on the night of August 30, 1997.
zh_cn: 1997年8月30日晚，在巴黎观光的时候，这对情人在试图逃离狗仔队的跟踪过程中被卷入了一场车祸。

source: Diana initially survived the crash, but later succumbed to her injuries at a Paris hospital a few hours later.
zh_cn: 戴安娜起初在这场车祸中幸存了下来，但是之后被伤痛的折磨压垮，几个小时之后就在巴黎的一家医院芳销韵陨。

source: Al-Fayed and the driver were also killed, and a bodyguard was seriously injured.
zh_cn: Al-Fayed和他的司机也都死了，保镖伤势严重。

source: French authorities investigated the crash and the driver was found to have a high level of alcohol in his system at the time of the accident.
zh_cn: 法国当局对这起车祸进行了调查，结果发现该司机在车祸发生时体内有很高的酒精含量。

source: The role of the pursuing photographers in the tragedy was also scrutinized.
zh_cn: 而跟踪拍照的狗仔队也是酿成这场悲剧的重要因素。

source: News of her sudden, senseless death shocked the world.
zh_cn: 戴安娜意外的毫无预兆的死亡噩耗震惊世界。

source: Thousands turned out to pay tribute to the "people's princess" during her funeral procession.
zh_cn: 数千人出现在她的送葬队伍中以对这个“人民的王妃”致敬。

source: The funeral was held at Westminister Abbey, which was broadcast on television.
zh_cn: 葬礼在威斯敏斯特大教堂举行，并通过电视进行直播。

source: Her body was later buried at her family's estate, Althorp.
zh_cn: 她的遗体随后被安葬在她家族墓地里。

source: In 2007, marking the tenth anniversary of her death, her sons, Princes William and Harry, honored their beloved mother with a special concert to be held on what would have been her 46th birthday.
zh_cn: 2007年，恰逢戴安娜逝世十周年，她的儿子，威廉王子和哈里王子举行了一场特殊的音乐会来纪念他们挚爱的母亲，他们把这场音乐会当做给他们母亲46岁生日的庆祝。

source: The proceeds of the event went to charities supported by Diana and her sons.
zh_cn: 这场活动的收益将捐献给由戴安娜和他儿子们支持的慈善机构。

source: Continuing her charitable efforts is the Diana, Princess of Wales Memorial Fund.
zh_cn: 戴安娜-威尔士王妃纪念基金延续着戴安娜的慈善事业。

source: Established after her death, the fund provides grants to numerous organizations and supports initiatives to provide care to the sick in Africa, help refugees, and stop the use of land mines.
zh_cn: 这项基金是在她逝世以后创立的，它向众多组织提供资助并支持一系列能够为非洲病患提供治疗、帮助难民以及阻止过度开采矿产的措施。
